# IsStringValue Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleFilter..::..IsStringValue Property
ScheduleFilter Class See Also
---
Indicates if the filter has a string value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsStringValue { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsStringValue As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsStringValue {
	bool get ();
}
```

# See Also
ScheduleFilter Class
Autodesk.Revit.DB Namespace